# База знаний. Полная и с разбалловкой
SPORT_RULES = {
    "Футбол⚽": {
        "max_score": 16,
        "keywords": {
            "экстраверсия": 3,
            "командность": 3,
            "смелость": 2,
            "инициативность": 2,
            "соревновательность": 3,
            "эмоциональная устойчивость": 1,
            "эмпатия": 2
        },
    },

    "Гандбол🤾": {
        "max_score": 15,
        "keywords": {
            "командность": 3,
            "энергичность": 3,
            "эмоциональная устойчивость": 2,
            "целеустремлённость": 2,
            "стойкость": 2,
            "неконфликтность": 3
        },
    },



    "Водное поло🤽": {
        "max_score": 16,
        "keywords": {
            "хладнокровие в хаосе": 4,
            "адекватная самооценка": 3,
            "стратегическое мышление": 3,
            "командность": 2,
            "настойчивость": 2,
            "внимательность": 2
        },
    },

    "Волейбол🏐": {
        "max_score": 17,
        "keywords": {
            "эмоциональная устойчивость": 3,
            "оптимизм": 4,
            "адаптивность": 3,
            "командность": 3,
            "инициативность": 2,
            "упорство": 2
        },
    
    },


    "Плавание🏊": {
        "max_score": 28,
        "keywords":{
        # Канонические понятия (
            "интровертность": 4,
            "самоконтроль": 5,
            "внутренняя мотивация": 6,
            "методичность": 5,
            "монотонность": 5,
            "независимость": 3,
            "терпеливость": 2,
            "самонаблюдение": 4,
        }
    },

    "Фигурное катание⛸️": {
        "max_score": 25,
        "keywords": {
            "публичная выразительность": 8,
            "дисциплина и план": 6,
            "концентрация": 3,
            "эмоциональный контроль": 3,
            "потребность в одобрении": 4,
            "внимание к деталям": 4,
            "стойкость": 2
        },

    },


    "Тяжелая атлетика💪": {
        "max_score": 15,
        "keywords": {
            "сила воли": 4,
            "концентрация": 4,
            "самодисциплина": 3,
            "упорство": 2,
            "эмоциональная устойчивость": 2
        },

    },

    "Фехтование⚔️": {
        "max_score": 25,
        "keywords": {
            "импровизация и гибкость": 4,
            "креативность": 4,
            "артистизм": 3,
            "стратегическое мышление": 3,
            "смелость и авантюризм": 3,
            "самоконтроль": 4,
            "дисциплина": 4
        },
    },

    "Шахматы♟️": {
        "max_score": 27,
        "keywords": {
            "аналитичность": 7,
            "стратегическое мышление": 7,
            "усидчивость": 5,
            "рациональность": 4,
            "осторожность": 3,
            "интровертность мышления": 4
        },
    },


    "Хоккей🏒": {
        "max_score": 15,
        "keywords": {
            "эмоциональная устойчивость": 3,
            "проницательность": 3,
            "смелость и решительность": 4,
            "настойчивость": 2,
            "командность": 3
        },
    },

    "Теннис🎾": {
        "max_score": 15,
        "keywords": {
            "эмоциональная устойчивость": 4,
            "рациональность": 3,
            "упорство": 3,
            "целеустремлённость": 3,
            "социальная открытость": 2
        },
    },

    "Конный спорт🐎": {
        "max_score": 13,
        "keywords": {
            "эмпатия и доверие": 4,
            "спокойствие": 3,
            "самостоятельность": 2,
            "ответственность": 2,
            "решительность": 2
        },
    },
}